/*
Task 1.

function task(str) {
	let symbol = String.fromCharCode(1089);
    let result = str.split('').filter(function(n){
        if (!(symbol.indexOf(n))) {
            return symbol;
        }
    });
    console.log(result.length);
}

task("Разбейте текст этой задачи на отдельные слова, удаляя по пути точки и запятые, а полученные слова сложите в массив. Напишите функцию, которая возвращает массив из тех же слов, но развёрнутых задом наперёд, причём массив должен быть отсортирован по количеству букв в слове. Напишите другую функцию, которая считает общее количество букв с во всех элементах массива.");


Task 2.

function task(str) {
	let symbol = String.fromCharCode(1089);
    let result = str.split('').filter(function(n){
        if (!(symbol.indexOf(n))) {
            return symbol;
        }
    });
    console.log(result);
}
task("Разбейте текст этой задачи на отдельные слова, удаляя по пути точки и запятые, а полученные слова сложите в массив. Напишите функцию, которая возвращает массив из тех же слов, но развёрнутых задом наперёд, причём массив должен быть отсортирован по количеству букв в слове. Напишите другую функцию, которая считает общее количество букв с во всех элементах массива.");
*/